public class FM {
    public static void main(String[] args) {
        System.out.println("Башҡортостан, hин hөйөклө ғәзиз ер,\n" +
                "Халҡыбыҙҙың изге Ватаны.\n" +
                "Сал Уралдан ҡалҡа бар тарафҡа\n" +
                "Тыуған илдең тыныс ал таңы");
        System.out.println("Дан hиңә, Башҡортостан!\n" +
                "Илен hөйгән азат халҡыңа дан!\n" +
                "Рәсәй менән бөйөк берҙәмлектә\n" +
                "Сәскә ат, Башҡортостан!");
        System.out.println("Башҡортостан, hин хөрмәтле данлы ил,\n" +
                "Еңеү яулап алға бараһың.\n" +
                "Киләсәккә яҡты нур-моң сәсә\n" +
                "Һинең ғорур рухлы байағың.");

        System.out.println("Дан hиңә, Башҡортостан!\n" +
                "Илен hөйгән азат халҡыңа дан!\n" +
                "Рәсәй менән бөйөк берҙәмлектә\n" +
                "Сәскә ат, Башҡортостан!");

        System.out.println("Республикам, йондоҙ булып балҡы hин,\n" +
                "Күҡрәп йәшә, гүзәл илебеҙ.\n" +
                "Тыуған ерҙә hүнмәҫ усағыбыҙ,\n" +
                "Туған телдә тынмаҫ йырыбыҙ");

        System.out.println("Дан hиңә, Башҡортостан!\n" +
                "Илен hөйгән азат халҡыңа дан!\n" +
                "Рәсәй менән бөйөк берҙәмлектә\n" +
                "Сәскә ат, Башҡортостан!\n" +
                "Туған телдә тынмаҫ йырыбыҙ");

    }

    public static void qm(String[] args) {
        System.out.println("ауф");
    }
}